<?php
/*
   Создайте 5 переменных с разными скалярными типами и присвойте им произвольные значения.
   Затем создайте переменные: $name, $age, $city, $job и присвойте им соответствующие данные.
   $job – логическая (да/нет). Есть работа?
   С помощью echo выведите все переменные в удобочитаемом виде.
*/
echo '<h2>dz1-1</h2>';
# ------------------------------------1------------------------------------------
$int = 5;
$float = 5.5;
$str = 'string';
$bool = true;
$null = null;
# ------------------------------------2------------------------------------------
$name = 'Max';
$age = 21;
$city = 'Tel-Aviv';
$job = true;
# ------------------------------------3------------------------------------------
echo 'Целое число --> ' .$int. '<br>';
echo 'Дробное число --> ' .$float. '<br>';
echo 'Строка --> ' .$str. '<br>';
echo 'Логический тип --> ' .$bool. '<br>';
echo 'NULL --> ' .$null. '<br>';

echo '-----------------------------<br>';

echo 'Имя: ' .$name. '<br>';
echo 'Возраст: ' .$age. '<br>';
echo 'Город: ' .$city. '<br>';
echo 'Работа: ' .$job. '<br>';
