<?php
/*
   Создайте переменную $str, которой присвойте строковое значение, содержащее отдельные слова разделённые пробелом.
   Выведите строку на экран.
   Затем разбейте строку на массив.
   Выведите массив.
   Затем используя циклы while или do-while (на ваше усмотрение)
   развернуть массив и склеить в строку используя любой символ, кроме пробела.
   Вывести результат.
 */
echo '<h2>dz1-9</h2>';
# ------------------------------------1------------------------------------------
$str = "first second third";
# ------------------------------------2------------------------------------------
echo "string --> $str<br>";
# ------------------------------------3------------------------------------------
$str_a = explode(' ', $str);
# ------------------------------------4------------------------------------------
echo 'array --> ';
print_r($str_a);
echo '<br>';
# ------------------------------------5------------------------------------------
$str = join('💛', $str_a);
# ------------------------------------6------------------------------------------
echo 'new string --> '.$str;