<?php
/*
   Создать ассоциативный массив $cars.
   Данные взять из задания №6.
   Требуется, чтобы все данные были в одном массиве.
   Реализовать через вложенные массивы.
   Вывести массив в удобочитаемом виде через конструкцию print_r и через foreach.
 */
echo '<h2>dz1-7</h2>';
# ------------------------------------1------------------------------------------
$cars = [
    $bmw = [
        "model" => "X5",
        "speed" => 120,
        "doors" => 5,
        "year" => 2015
    ],
    $toyota = [
        "model" => "Sequoia ",
        "speed" => 160,
        "doors" => 5,
        "year" => 2014
    ],
    $opel = [
        "model" => "Astra ",
        "speed" => 110,
        "doors" => 3,
        "year" => 2016
    ]
];
# ------------------------------------2------------------------------------------
foreach ($cars as $key => $value) {
    print_r("$key <br>");

        foreach($value as $k => $v) {
            print_r("$k: $v <br>");
        }
    echo '---------------<br>';
}











